#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/STD/STD/runs/run-kx5FwneKqvaPqUpp

Waiting for the plan to start...

Terraform v1.10.3
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ecs_optimized_ami: Refreshing...
aws_security_group.allow_http_ssh: Refreshing state... [id=sg-084ae11333226dd2e]
data.aws_ami.ecs_optimized_ami: Refresh complete after 1s [id=ami-000ccf3b2856b395e]
aws_instance.ecs_instance: Refreshing state... [id=i-0f3b6de0955c2b840]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_elasticache_cluster.example will be created
  + resource "aws_elasticache_cluster" "example" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "my-redis-cluster"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = (known after apply)
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis6.x"
      + port                       = (known after apply)
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + security_group_names       = (known after apply)
      + snapshot_window            = (known after apply)
      + subnet_group_name          = (known after apply)
      + tags_all                   = (known after apply)
    }

  # aws_instance.ecs_instance will be updated in-place
  ~ resource "aws_instance" "ecs_instance" {
        id                                   = "i-0f3b6de0955c2b840"
        tags                                 = {
            "Name" = "STD-EC2"
        }
      + user_data                            = (known after apply)
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group.elasticache_sg will be created
  + resource "aws_security_group" "elasticache_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for Elasticache"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow inbound traffic from EC2 instances"
              + from_port        = 11211
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 11211
            },
        ]
      + name                   = "elasticache-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + elasticache_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Sipixer, Action: `pull_request`*